GitLab.com 깃랩


제공 언어: 영어

모기업: GitLab Inc(미국 샌프란시스코)

역사: 우크라이나 개발자인 드미트리 자포로제츠와 발레리 시조프가 2011년에 만들었다. 원격 협업 개발을 원했던 창업자의 필요에 따라 처음부터 코드 저장소 서비스면서 원격 협업 도구 세트로 설계되었다.

특징: 오픈소스 기반의 데브옵스 통합 플랫폼 기업
1. 오픈소스: GitLab 프로젝트 자체가 오픈소스여서 직접 서비스 발전에 기여할 수 있다.
2. 데브옵스: 개발(development)과 운영(operation)을 결합한 데브옵스 플랫폼이다. 데브옵스는 전통적으로 분리되어 있었던 개발팀과 운영팀이 같이 움직이는 방법론이다. + 최근 보안(security)까지 통합.
3. 가동 시간: 99% 가동 시간이라는 더 높은 가용성을 보장한다.
4. 브랜치 분리: 변경한 각 세트를 마스터 브랜치와 별도의 안정적인 브랜치로 생성한다. 프로덕션과 스테이징의 분기가 최소한으로 있다. 이러한 다중 분기 접근방식은 여러 단계의 테스트 프로세스를 필요로 한다. 병합 요청 시 코드 검토가 까다로워진다.
5. 완전한 소프트웨어 개발 솔루션: 지라(Jira), 마이크로소프트 팀즈, 슬랙, G메일 같은 애플리케이션 및 플랫폼과 통합을 제공한다.
NASA, Sony 등 10만 개 이상의 조직이 사용하고 있다. 사용자 친화적이며 여러 비즈니스에 유용하게 활용할 수 있다. 소프트웨어의 제품 개발부터 배포와 실시간 모니터링까지 하나의 툴로써 관리되기 때문에 IT, 금융, 보험, 정유 등 다양한 분야의 엔터프라이즈 고객들이 깃랩의 제품을 사용 중이다.

가격 정책:
무료: 0$
5GB 저장 용량, 매월 10GB 전송, 월 400CI/CD 분
네임스페이스당 5명의 사용자

프리미엄: 19$
50GB 저장 용량, 매월 100GB 전송, 월 10,000CI/CD 분
코드 소유권 및 브랜치 보호, 병합 요청과 승인 규칙, 고급 CI/CD, 엔터프라이즈 사용자 및 인시던트 관리

얼티메이트: 99$
250GB 저장 용량, 매월 500GB 전송, 월 50,00CI/CD 분
무료 게스트 사용자, 동적 애플리케이션 보안 테스트, 정적 애플리케이션 보안 테스트, 보안 대시보드, 취약점 관리, 종속성 스캔, 컨테이너 스캐닝, 다단계 에픽, 가치 흐름 관리